cf_billing/InformationRegisters/энргКорректировкаПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКорректировкаПоказаний</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказанияДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСхемуПодчиненностиТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктированиеНедопускаДопускаВПомещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/энргКорректировкаПоказаний/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет скорректированные показания.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция СкорректированныеПоказания(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСкорректированныеПоказания());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	

	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, КлючПомещения, ЧастныйСектор, Строение, Помещение, ПриборУчета, Шкала, ТарифнаяЗона, Разделитель, ДокРегистратор";
		ИмяТаблицы 					= "КорректировкаПоказаний";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСкорректированныеПоказания()
	
	Текст = 
	"ВЫБРАТЬ
	|	КорректировкаПоказаний.Период КАК Период,
	|	КорректировкаПоказаний.Регистратор КАК Регистратор,
	|	КорректировкаПоказаний.Организация КАК Организация,
	|	КорректировкаПоказаний.Район КАК Район,
	|	КорректировкаПоказаний.КлючПомещения КАК КлючПомещения,
	|	КорректировкаПоказаний.ПриборУчета КАК ПриборУчета,
	|	КорректировкаПоказаний.Шкала КАК Шкала,
	|	КорректировкаПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	КорректировкаПоказаний.Разделитель КАК Разделитель,
	|	КорректировкаПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	КорректировкаПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	КорректировкаПоказаний.ПоказанияДо КАК ПоказанияДо,
	|	КорректировкаПоказаний.ПоказанияПосле КАК ПоказанияПосле,
	|	КорректировкаПоказаний.Строение КАК Строение,
	|	КорректировкаПоказаний.Помещение КАК Помещение,
	|	КорректировкаПоказаний.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаПоказаний.Период КАК Период,
	|		КорректировкаПоказаний.Регистратор КАК Регистратор,
	|		КорректировкаПоказаний.Организация КАК Организация,
	|		КорректировкаПоказаний.Район КАК Район,
	|		КорректировкаПоказаний.КлючПомещения КАК КлючПомещения,
	|		КорректировкаПоказаний.ПриборУчета КАК ПриборУчета,
	|		КорректировкаПоказаний.Шкала КАК Шкала,
	|		КорректировкаПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|		КорректировкаПоказаний.Разделитель КАК Разделитель,
	|		КорректировкаПоказаний.ДокРегистратор КАК ДокРегистратор,
	|		КорректировкаПоказаний.ПериодНачисления КАК ПериодНачисления,
	|		КорректировкаПоказаний.ПоказанияДо КАК ПоказанияДо,
	|		КорректировкаПоказаний.ПоказанияПосле КАК ПоказанияПосле,
	|		энргКлючиПомещений.Строение КАК Строение,
	|		энргКлючиПомещений.Помещение КАК Помещение,
	|		энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|	ИЗ
	|		РегистрСведений.энргКорректировкаПоказаний КАК КорректировкаПоказаний
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО КорректировкаПоказаний.КлючПомещения = энргКлючиПомещений.Ссылка) КАК КорректировкаПоказаний";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
